import tiktoken

CONTENT = """为传承弘扬中华传统戏曲文化，进一步推动戏曲艺术在学生群体中的普及、推广与传承，由上海市民文化节指导委员会指导，我校承办的中华梨园经典"赏戏团"进校园暨"传承、传播"上海中青年戏剧家讲演专题讲座于12月20日下午在奉贤校区敬贤堂举办。 本期专题讲座邀请到上海评弹团团长、国家一级演员、中国曲艺最高奖"牡丹表演奖"获得者、评弹名家高博文主讲，三位上海评弹团青年艺术家担任助演。200余名师生到场聆听，充分感受江南文化的魅力。 高博文以评弹的发展历史为主线贯穿整场讲座，介绍到评弹不同于京剧、昆曲等其他传统戏曲艺术，其五大基本功：说噱弹唱演，其最大的特色便是一人饰多角，跳进跳出。艺人在转换角色的过程中，动作并没有给人感觉有明显的隔离，而是顺其自然，更多地通过动作习惯、表情、神色和声调，将不同的角色表现得惟妙惟肖。配合高博文的介绍，担任助演的青年艺术家现场表演了《江南好风光》与《长生殿-絮阁》等片段。 此次活动在学生中引起积极反响，参加的同学很多是第一次接触评弹这种艺术，被其清新细腻的风格所感动。来自台湾的黄立纲同学难掩兴奋之情表示"若是之后有机会，定会去茶楼书场间听一段评弹。也非常期待上海评弹团可以再来我们学校，给我们带来更多精彩的表演。" 早在2008年评弹就作为第一批文化项目入选国家级非物质文化遗产名录，评弹是一门历史悠久、优美动听的说唱艺术，是评话和弹词的总称。它以幽默细腻的说白，婉转动听的演唱，声情并茂的表演和珠落玉盘般的弹奏闻名于世，被誉为"中国最美的声音"。为更深入地了解评弹，了解我国非遗文化，材料学院团校联合学校辅导员培育项目"京剧茶座"组织了此次活动。"""


def sentence_is_valid(
        sentence: str,
) -> int:
    enc = tiktoken.encoding_for_model("gpt-3.5-turbo")
    tokens = enc.encode(sentence)
    return len(tokens)


if __name__ == '__main__':
    token_count = sentence_is_valid(CONTENT)
    print(f"token数量：{token_count}")
